test/jmeter-results/report/statistics.json
{
  "01 DB Connection OK" : {
    "transaction" : "01 DB Connection OK",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 354.0,
    "medianResTime" : 354.0,
    "minResTime" : 354.0,
    "maxResTime" : 354.0,
    "pct1ResTime" : 354.0,
    "pct2ResTime" : 354.0,
    "pct3ResTime" : 354.0,
    "throughput" : 2.824858757062147,
    "receivedKBytesPerSec" : 0.0855181850282486,
    "sentKBytesPerSec" : 0.0
  },
  "02 UI Components Exist" : {
    "transaction" : "02 UI Components Exist",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.0,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 500.0,
    "receivedKBytesPerSec" : 11.71875,
    "sentKBytesPerSec" : 0.0
  },
  "Load Antenna By ID" : {
    "transaction" : "Load Antenna By ID",
    "sampleCount" : 5000000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.12208780000000594,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 27.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 8329.654402638835,
    "receivedKBytesPerSec" : 963.2414872884268,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10000005,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.11405554297221093,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 354.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 16649.470547101326,
    "receivedKBytesPerSec" : 1848.4346855254778,
    "sentKBytesPerSec" : 0.0
  },
  "Load UI Component By ID" : {
    "transaction" : "Load UI Component By ID",
    "sampleCount" : 5000000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.10594839999999756,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 354.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 8324.731111185109,
    "receivedKBytesPerSec" : 885.7307442465702,
    "sentKBytesPerSec" : 0.0
  },
  "04 Antenna Relations Valid" : {
    "transaction" : "04 Antenna Relations Valid",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.0,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 500.0,
    "receivedKBytesPerSec" : 12.6953125,
    "sentKBytesPerSec" : 0.0
  },
  "05 UI Layout Load" : {
    "transaction" : "05 UI Layout Load",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.0,
    "medianResTime" : 16.0,
    "minResTime" : 16.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 16.0,
    "throughput" : 62.5,
    "receivedKBytesPerSec" : 1186.58447265625,
    "sentKBytesPerSec" : 0.0
  },
  "03 UI Coordinates Valid" : {
    "transaction" : "03 UI Coordinates Valid",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1000.0,
    "receivedKBytesPerSec" : 25.390625,
    "sentKBytesPerSec" : 0.0
  }
}